[
    {
      "_id": "1",
      "title": "Bremont Arrow",
      "desc": "The Bremont Arrow is a 42mm cased mono-pusher chronograph. The pusher at 2 o’clock on the two-piece hardened steel case will start, stop and reset the stopwatch on the chronometer rated BE-51AE movement. The Arrow plays on the same British military DNA as the Broadsword but is aimed at the airman with its chronograph functionality, a necessity for any timed mission. The sub-dial at 9 o’clock is a running seconds, and the chronograph has elapsed minutes on the 3 o’clock counter. RAF blue sailcloth strap",
      "price": 1695,
      "image": "https://i.ibb.co/4M82Qmx/A-watch1.png"
    },
    {
      "_id": "2",
      "title": "Bremont Broadsword",
      "desc": "Bremont is extremely proud to be the first watch brand to sign the United Kingdom’s Armed Forces Covenant in February 2019. The Bremont Broadsword is a contemporary take on the three handed ‘Dirty Dozen’ watch design which houses the chronometer rated BE-95-2AV movement inside its two-piece 40mm hardened steel case as well as a sub-seconds hand at 6 o’clock. Multiple layers of luminous paint on the hands and dial complete the original specification for the British Army. Khaki green sailcloth strap.",
      "price": 2595,
      "image": "https://i.ibb.co/WgRQJXB/A-watch2.png"
    },
    {
      "_id": "3",
      "title": "Argonaut",
      "desc": "The Argonaut, a name inspired by Greek mythology and synonymous with Navy history having appeared on Commissioned ships for nearly 250 years. This exciting new 42mm hardened steel-cased military dive watch, houses a three-handed chronometer rated BE-92AV movement. The internal rotating bezel is operated by a crown at 4 o’clock, and readability on both the hands and dial have been crucial in the design process. With minutes being so critical in the marine environment, the highly legible orange minute hand can be seen very clearly and is filled with custom green Super-LumiNova. Navy blue sailcloth strap",
      "price": 2700,
      "image": "https://i.ibb.co/5MSDBqz/A-watch3.png"
    },
    {
      "_id": "4",
      "title": "Broadsword Bronze",
      "desc": "One of Bremont’s proudest achievements to date was the beginning of an official partnership with the Ministry of Defence (MoD) in 2019, paying tribute to Her Majesty’s Armed Forces. Through this partnership, Bremont became the sole luxury watch producer legitimately allowed to use the signs, symbols and Heraldic Badges of all three services; the Royal Navy, British Army and Royal Air Force. 2020 sees the introduction of the Broadsword Bronze timepieces, adding to the original line up in Bremont’s Armed Forces Collection.",
      "price": 1490,
      "image": "https://i.ibb.co/x5sjcwC/A-watch4.png"
    },
    {
      "_id": "5",
      "title": "Wright Flyer M05",
      "desc": "The 1903 Wright Flyer was built and designed by the Wright Brothers themselves in Dayton, Ohio, USA. It’s the invention and aircraft that changed the way we live today and it has now inspired our latest, and perhaps most unique, limited edition timepiece. The Wright Flyer timepieces feature some of the original fabric used on the 1903 Wright Flyer aircraft. Just as significantly, they showcase Bremont’s first ever proprietary movement, the BWC/01, part-developed and designed in Britain with our Swiss partners. Limited to 50 pieces.",
      "price": 1795,
      "image": "https://i.ibb.co/njgq50B/B-watch1.png"
    },
    {
      "_id": "6",
      "title": "Wright Flyer M07",
      "desc": "The 1903 Wright Flyer was built and designed by the Wright Brothers themselves in Dayton, Ohio, USA. It’s the invention and aircraft that changed the way we live today and it has now inspired our latest, and perhaps most unique, limited edition timepiece. The Wright Flyer timepieces feature some of the original fabric used on the 1903 Wright Flyer aircraft. Just as significantly, they showcase Bremont’s first ever proprietary movement, the BWC/01, part-developed and designed in Britain with our Swiss partners. Limited to 50 pieces.",
      "price": 1300,
      "image": "https://i.ibb.co/QJb704f/B-watch2.png"
    },
    {
      "_id": "7",
      "title": "H-4 Hercules",
      "desc": "At a time of austerity, one American defied convention to build the largest aircraft in the world. Famously known as the ‘Spruce Goose’, the H-4 Hercules and Howard Hughes’ genius was defined by one minute. One minute of flight on 2nd November 1947. In that time Howard Hughes’ vision for the greatest aircraft ever built was vindicated. It’s fitting therefore that the aircraft is being commemorated by a timepiece of this stature.",
      "price": 1095,
      "image": "https://i.ibb.co/86vWGb9/B-watch3.png"
    },
    {
      "_id": "8",
      "title": "H-5 Hercules",
      "desc": "At a time of austerity, one American defied convention to build the largest aircraft in the world. Famously known as the ‘Spruce Goose’, the H-4 Hercules and Howard Hughes’ genius was defined by one minute. One minute of flight on 2nd November 1947. In that time Howard Hughes’ vision for the greatest aircraft ever built was vindicated. In a sublime fusion of micro-engineering, watch design and aviation history, the Bremont H-4 Hercules Limited Edition chronometer is limited to only 75 Platinum pieces. It salutes this iconic flying boat of the 1940s and contains original birchwood from the fuselage of this iconic silver flying boat.",
      "price": 1195,
      "image": "https://i.ibb.co/kB54ZwY/B-watch4.png"
    },
    {
      "_id": "9",
      "title": "ALT1-P2",
      "desc": "Having spent 5 years in research and development the ALT1-P Pilot chronograph which has become a popular choice with civilians and aviation professionals, is a watch for all. ‘P’ stands for Pilot as this is a model designed with aviators in mind who demand both accuracy and clarity. Bremont always aimed to create classically understated watches which would never date and the ALT1-P has exemplified this being synonymous with the core Bremont values. As with every classic design, evolution is a necessity and this year sees Bremont update one of its classics.",
      "price": 3595,
      "image": "https://i.ibb.co/4m970zg/C-watch1.png"
    },
    {
      "_id": "10",
      "title": "ALT1-C",
      "desc": "The ALT1-C Anthracite remains true to each of the technical principles behind any revered automatic timepiece. Integrating an impeccably modified, chronometer-rated Valjoux 7750-SO BI AC movement, the ALT1-C Anthracite brings together art of watch making with the very best of technical innovation, precision and durability.",
      "price": 3400,
      "image": "https://i.ibb.co/gtkRQdm/C-watch2.png"
    },
    {
      "_id": "11",
      "title": "ALT1-WT",
      "desc": "In 2010 Bremont was commissioned to produce a unique global timer chronometer for the military C-17 Globemaster crew. Bremont developed this ‘Globemaster’ watch as the Bremont World Timer for the civilian market and produced their first global timer watch. Features include an etched globe on the dial, all 24 time zones, a Trip-Tick case and Roto-click bezel.",
      "price": 3900,
      "image": "https://i.ibb.co/xjm4nCY/C-watch3.png"
    },
    {
      "_id": "12",
      "title": "ALT1-ZT/51",
      "desc": "The ALT1-Z was designed with aviators and world travellers in mind. Z stands for ‘Zulu Time’ and allows the wearer to display local time together with the official world time standard: Universal Time Coordinated (UTC), Greenwich Mean Time (GMT), or even Zulu time (Z). This watch maintains the clean legible dial with the 24hr function having been moved to the bezel for improved clarity. Greater detailing around the stepped sub dials with micro lines on the ZT models has been made to give the dial more depth. Stainless steel bracelet.",
      "price": 1895,
      "image": "https://i.ibb.co/tKW4LXW/C-watch4.png"
    },
    {
      "_id": "13",
      "title": "ALT1-P2 JET",
      "desc": "Based on the original ALT1P pilot’s watch, the definitive aviation chronograph, the hardened DLC case and black dial of the ALT1-P2 JET combined with our iconic ’51 lume’ offers total clarity and legibility to the wearer. Passionate about celebrating British engineering and innovation as part of the testing cycle we have teamed up with veritable aviation pioneers Gravity Industries to test the ALT1-P2 JET. This is the first DLC coated case in this line and turning the watch over reveals a smoked crystal exhibition case back with a black rotor continuing the stealthy aesthetic. Pictured here on a black leather strap with DLC coated pin buckle.",
      "price": 4195,
      "image": "https://i.ibb.co/yFdQWbS/D-watch1.png"
    },
    {
      "_id": "14",
      "title": "SOLO-36",
      "desc": "Our classic mechanical timepieces for the modern traveller offer a range of complications aiding you to keep track of time while you navigate the globe. Bremont travel watches are constructed to withstand the rigours of your journey be it airborne, seaborne or overland. We also recognize that when you travel, you only want to carry one watch. Whether heading to the boardroom or satiating your wanderlust, Bremont wish you bon voyage.",
      "price": 3895,
      "image": "https://i.ibb.co/x5QcrHV/D-watch2.png"
    },
    {
      "_id": "15",
      "title": "ALT1-C GRIFFON",
      "desc": "This model in particular pays tribute to the Spitfire that brand Co-Founders Nick and Giles English’s father operated and is now owned by Rolls-Royce. The PR Mk XIX was the last of the specialised photo reconnaissance variants of the Spitfire, one of the few with a Griffon engine and arguably the finest of them all. The ALT1-C Griffon remains true to each of the technical principles behind any revered automatic timepiece. Integrating an impeccably modified, chronometer-rated Valjoux 7750-SO BI AC movement, the ALT1-C Griffon brings together the art of watchmaking with the very best of technical innovation, precision and durability. Pictured here on a brown vintage leather strap.",
      "price": 1490,
      "image": "https://i.ibb.co/s2H1hHq/D-watch3.png"
    },
    {
      "_id": "16",
      "title": "SOLO-37",
      "desc": "Inspired by Amy Johnson, this watch celebrates graceful determination. Originally inspired from a technique used widely in the aerospace industry, the signature coating provides high impact resistance whilst maintaining its polished surface finish. The convex sapphire crystal is treated with nine layers of anti-reflective coating applied to both sides of the glass for increased legibility. The high standard of finish and attention to detail can be seen in the meticulous machining of the three-part cases which take considerable time and skill to apply.",
      "price": 3795,
      "image": "https://i.ibb.co/tM8nPzN/D-watch4.png"
    }

  ]